{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,256,256,3],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"separable_conv2d_SeparableConv2D1","class_name":"SeparableConv2D","config":{"filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D1","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"depthwise_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"pointwise_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D2","class_name":"SeparableConv2D","config":{"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D2","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"depthwise_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"pointwise_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D2",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D3","class_name":"SeparableConv2D","config":{"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D3","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"depthwise_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"pointwise_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["max_pooling2d_MaxPooling2D2",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["separable_conv2d_SeparableConv2D3",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./lightweight_feature_extractor_model.weights.bin"],"weights":[{"name":"separable_conv2d_SeparableConv2D1/depthwise_kernel","shape":[3,3,3,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/pointwise_kernel","shape":[1,1,3,32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/pointwise_kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/pointwise_kernel","shape":[1,1,64,128],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[64],"dtype":"float32"}]}]}